Autodesk.Revit.DB.Architecture.RailingHeightCorrectionOption
Railing height correction option.
Since:
2013

Autodesk.Revit.DB.Architecture.RailingHeightCorrectionOption.Custom
User needs to define the height value of the railing.

Autodesk.Revit.DB.Architecture.RailingHeightCorrectionOption.ByType
Railing height is determined by railing type.